const data = {
    uriREGEX: /^([a-z][a-z0-9\*\-\.]*):\/\/(?:(?:(?:[\w\.\-\+!$&'\(\)*\+,;=]|%[0-9a-f]{2})+:)*(?:[\w\.\-\+%!$&'\(\)*\+,;=]|%[0-9a-f]{2})+@)?(?:(?:[a-z0-9\-\.]|%[0-9a-f]{2})+|(?:\[(?:[0-9a-f]{0,4}:)*(?:[0-9a-f]{0,4})\]))(?::[0-9]+)?(?:[\/|\?](?:[\w#!:\.\?\+=&@!$'~*,;\/\(\)\[\]\-]|%[0-9a-f]{2})*)?$/
};

const errors = {
    wrongDellivery: 'Укажите вид доставки',
    wrongEmail: 'Введите корректный электронный адрес',
    wrongPassword: 'Требуется указать правильный пароль',
    wrongCaptcha: 'Значение указано неверно',
};

module.exports = {
    data: data,
    errors: errors
};